const courses = [
    {
        id: 0,
        title: "Основы Python",
        description: "Отличное введение в мир программирования для тех, кто только начинает свой путь в этой области. Python - мощный инструмент с простым и понятным синтаксисом, и этот курс поможет вам освоить его базовые концепции и возможности. Независимо от вашего уровня подготовки, вы сможете легко усвоить материал благодаря понятным объяснениям и практическим заданиям. После завершения курса вы будете готовы к более продвинутым темам и проектам в области программирования на Python.",
        taskcount: 10,
        solvedtasks: 0,
        tasks: [
            {
                id: 0,
                name: "Основы Python",
                status: 0
            },
            {
                id: 1,
                name: "Вывод текста в Python",
                status: 0,
                text: "Напишите программу, которая выводит на экран 'Hello, World!'",
                input: "Отсутствуют",
                output: "Hello, World!",
                note: "Программа выводит строку Hello, World!"
            },
            {
                id: 2,
                name: "Сумма чисел от 1 до 100"
            },
            {
                id: 3,
                name: "Среднее арифметическое двух чисел"
            },
            {
                id: 4,
                name: "Сумма чисел от 1 до 100"
            },
            {
                id: 5,
                name: "Квадратный корень из числа"
            },
            {
                id: 6,
                name: "Наибольший делитель"
            },
            {
                id: 7,
                name: "Палиндромы"
            },
            {
                id: 8,
                name: "Простые числа"
            },
            {
                id: 9,
                name: "Сортировка чисел"
            },
            {
                id: 10,
                name: "Факториал числа"
            },
        ]
    }
]

export {courses};